<template>
  <div>

    <Head></Head>
    <el-container>
      <el-main>
        <div style="text-align:center">
          <el-button
            class="goback"
            type="primary"
            @click="goBack"
            icon="el-icon-back"
          ></el-button>
          <div class="words">
            <h3>
              汉服知识
            </h3>
          </div>
          <el-divider></el-divider>
        </div>
        <template>
          <el-tabs
            v-model="activeName"
            @tab-click="handleClick"
            style="font-family:'楷体';font-size:20px;"
          >
            <el-tab-pane
              label="汉服历史"
              name="first"
            >
              <el-container>
                <el-timeline>
                  <el-timeline-item
                    timestamp="前26世纪初-前21世纪初"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>神话及传说时代汉服</h4>
                      <p>
                        神话及传说起源——中华始祖，传说中的上古帝王轩辕氏，黄帝统一华夏部落。在他治下，政治安定，文化进步，国势强盛，有很多的发明和创作，如文字，农业，音乐，历法等。黄帝的正妃——嫘祖，传说中就是她首创养蚕制丝织绢，从而发明了汉服。嫘祖衣被天下，丝美中华，西周以来，奉为中华母祖，尊为先蚕。
                      </p>
                      <p>
                        实际起源——远古时期，生产力极端低下，对人类来说，服饰的起源是出于实用。石器时代后，人们掌握了制造工具和使用工具的方法，发明了骨锥和骨针．从而创造了原始服装。约五千年前，中国在新石器时代的仰韶文化时期，人们的生活日趋稳定，产生了原始的农业和纺织业，开始用织成的麻布来做衣服，后又发明了饲蚕和丝纺，人们的衣冠服饰日臻完备。
                      </p>
                      <img
                        src="@/assets/images/knows/history/神话传说时代.jpg"
                        class="image"
                      />
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="前21世纪末-前17世纪初"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>夏朝汉服（公元前2070年）</h4>
                      <p>
                        夏朝的服饰以黑为主。夏朝是占木德而成天下,尚青色,故服饰用青色。夏代是我国历史上的第一个朝代。其服饰带有鲜明的宗教信仰色彩，其确立的上衣下裳的形制和玄衣黄裳的服色。其中上衣代表天，因为天在未明时为玄色，故上衣用玄色，下裳象征地，因为土地为黄色，故下裳用黄色。
                      </p>
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="前17世纪初-前11世纪"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>商朝汉服（公元前1600年左右）</h4>
                      <p>
                        商朝是中国第一个有文字记载的朝代。根据众多的考古发现，这一时期的汉服基本样式已经完全成型。这一时期的服装主要由两部分组成，上衣和下裳（裙）。袖口较窄，没有扣子，在腰部束着一条宽边的腰带，肚围前再加一条像裙一样的“蔽膝”，用来遮蔽膝盖。
                      </p>
                      <p>
                        这个时期的织物颜色，以暖色为多，尤其以黄红为主，间有棕色和褐色，但并不等于不存在篮、绿等冷色。只是以朱砂和石黄制成的红黄二色，比其他颜色更鲜艳，渗透力也较强，所以经久不变并一直保存至今。经现代科技分析，商周时期的染织方法往往染绘并用，尤其是红、黄等正色，常在织物织好之后，再用画笔添绘。
                      </p>

                      <p>
                        上衣下裳：据考证，商朝时期就出现了上衣下裳（注：上穿衣下穿裳（裙），上下配套）款式，只不过那时的上袖子较短，下裳也较窄，那时已出现交领，后来一直延续到明。常服礼服那时就已分开，礼服制度，初步建立在那时，但还不完善。上衣下裳为举国通行的统一款式。综上所述，那时民族服装属性已经确立，上衣下裳为漢服体系的第一个款式，也是在后期属于最本原的款式。
                      </p>
                      <p>
                        上衣下裤：据说那时已经有了裤，不过都是开裆的，而开裆裤只能是穿在上衣下裳里面的。
                      </p>
                      <p>
                        发型：初期男子编辫，后期则将编好的辫盘到头顶，成为后来男子束发（漢族男子发式）的基础。
                      </p>
                      <p>
                        冠帽巾：那时已有了冠的雏形。
                      </p>
                      <img
                        src="@/assets/images/knows/history/商朝汉服.jpg"
                        class="image"
                      />
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="前11世纪-前771年"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>西周服饰（公元前1042年左右）</h4>
                      <p>
                        周朝以封建制度建国，以严密的阶级制度来巩固帝国，制定一套非常详尽周密的礼仪来规范社会，来安定天下。服装是每个人阶级的标志，因此服装制度是立政的基础之一，规定是非常严格的。
                        周代服饰大致沿袭商代服制而略有变化。衣服的样式比商代略为宽松。衣袖有大小两种样式，领子通用交领右衽。不使用钮扣，一般腰间系带，有的在腰上还挂有玉制饰物。裙或裤的长度短的及膝，长的及地。
                      </p>

                      <p>
                        冠服制度：西周最大的贡献以及对于后世的影响就是礼服制度（也叫冠服制度）的完善。西周时期的礼服制度也是上衣下裳款式，只不过头要戴冠（那时的各种冠已发展完善，并延续后世），衣裳要有等级，要有章纹，出现敝膝，组玉等相关礼服配件，这样完善的礼服系统一直延续到明。当时礼服的主要等级，有冕服弁服，之所以这样叫，取决于相关配套的冠的款式，比如戴冕就是冕服，戴弁就是弁服，他们仍旧是上衣下裳制，只不过是冠与章纹，配件等级的不同而已。冕服弁服作为礼服的高等级别，一直延续到明。只不过那时天子，诸侯王，公卿，大夫都可以都可以穿冕服，后来中央集权的加强，只天子，诸侯王能穿了。那时的女子礼服，王后已经开始穿翟衣，当时王后有六种翟衣类礼服。
                      </p>
                      <p>
                        上衣下裳：那时的常服还是上衣下裳为主流，款式不变。只不过袖日趋发展变大，形成大袖，祛袂款式。衣裳也逐渐变宽。
                      </p>
                      <p>
                        发型：当时西周的男子无论各地大部分都已将辫盘到头顶，而无再有商时披头散发的习惯，当然一些偏国除外，不过束发已成为全国统一推行的标准，对于漢民族男子千百年来的发式，起到了奠定作用。
                      </p>
                      <p>
                        冠帽巾：那时的冠已发展齐全完善，基本后世的冠在当时都可以看到，有鹊尾冠，尚冠，长冠，筒冠，冕，弁等。帽类在当时亦有了雏形。
                      </p>
                      <img
                        src="@/assets/images/knows/history/西周服饰.jpg"
                        class="image"
                      />
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="前771年-前256年"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>东周（春秋）汉服（公元前770年左右）</h4>
                      <p>
                        春秋战国时期诞生了一种重要的汉服——深衣。
                        深衣是直筒式的长衫，把衣、裳连在一起包住身子，分开裁但是上下缝合，因为“被体深邃”，因而得名。深衣延续了汉服交领右衽的特点，在社会上影响很大，不论贵贱男女、文武职别，都可以穿着。裙分为曲裾和直裾两种样式，外观区别在于下身是否有围绕的线条。这一时期纺织和染色技术已经非常发达，汉服上已经出现很多繁复华丽的图案。
                      </p>
                      <p>
                        上衣下裳：常服礼服依旧是上衣下裳制，而且大袖只用于礼服中已成为定制。而且已趋向于精美化发展，当时玉已不去身。
                      </p>
                      <p>
                        上衣下裤：据一些资料考证，漢族人早在胡服骑射以前就有了合裆裤，也有了短衣下面直接搭配裤的装束。
                      </p>
                      <p>
                        衣裳连制（深衣）：值得一提的是，由于春秋战国时期思想变动较大，另外一个漢服大款式深衣的产生（深衣其实就是上衣下裳制的连接版，也是交领。由于生产力的发展，普通的麻烦装束已满足不了人民的需要，而衣裳连制，能文能武，可以礼仪可以常服，是漢服款式的一个进步）。深衣裳由12幅片拼接而成，代表12个月。分直裾，曲裾两种。直裾后来作为深衣的主流样式，一直沿用到明，春秋战国秦漢时期的直椐下摆显的较窄。和直椐不同的是，曲裾魏晋以后衰落，但也不是断代，因明朝的朱子深衣，还存在曲裾的样式。而直裾历代一直盛行，后世成为庶人的民间礼服和士大夫阶层的居家便服。春秋战国初深衣的袖子，还多是直筒祛，后来袖子垂下部分日趋宽大，形成半圆形垂弧度（袂），但仍是收口（祛），因此形成外观看半圆形弧度的袖子（祛袂），这样的袖子成为深衣的定制，只要是代表一种思想。当时的袖子，已有长袖，但只舞蹈时才有。
                      </p>
                      <img
                        src="@/assets/images/knows/history/东周服饰.jpg"
                        class="image"
                      />
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="前221年-前206年"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>秦朝汉服（公元前221年左右）</h4>
                      <p>
                        公元前221年，秦灭六国，秦始皇 赢政
                        建立了中国历史上第一个大一统国家。秦始皇统一了文字，货币，度量衡等，为中华国家势力和汉民族的形成及延续留下了极其深远的影响。
                      </p>
                      <p>
                        秦代汉服主要承前朝影响，仍以袍为典型服装样式，分为曲裾和直裾两种，袖也有长短两种样式。秦代男女日常生活中的服饰形制差别不大，都是大襟窄袖，不同之处是男子的腰间系有革带，带端装有带钩；而妇女腰间只以丝带系扎。因为秦始皇陵
                        兵马俑
                        的发现，秦代的服饰和风俗研究有着丰富的历史资料。
                      </p>
                      <img
                        src="@/assets/images/knows/history/秦朝汉服.jpg"
                        class="image"
                      />
                      <p>
                        舆服制度：西漢在周制冠服制度的基础上进行改进，形成了舆服制度，制度出皇帝，品官的礼服，朝服，常服20多种，这20几种，同周制一样，基本也是以不同的冠去区分，礼服，朝服仍是上衣下裳制，礼服的配件组玉敝膝等也不变，东漢产生了绶与佩这样的新配件，而且通过绶佩的高底来区分品官的等级。因此只是较之周制更等级化，细节化，丰富化而已，款式基本还是采用周制，后世礼服，以周制为骨架，秦漢为血肉的基础上，一直延续到明，这以后，礼服基本可以确立，变化很小了。
                      </p>
                      <p>
                        上衣下裳和深衣：民间常服依旧是上衣下裳制和深衣制，只不过深衣已逐渐代替上衣下裳成为主流，并且下裳较之前朝日趋变宽大。
                      </p>
                      <p>
                        上衣下裤：劳动人民仍是上短衣下面直接配裤的装束。
                      </p>
                      <p>
                        上襦下裙：值得一提的是，在漢朝已经被泛滥化的深衣的天下，人们似乎又开始怀念起上衣下裳装束来，于是女子又开始穿起了上衣下裳，只不过上衣短小，一般标准到腰胯部，扎到裙子里面，袖子窄小，裙子宽大，
                        因此，他大抵来说是属于上衣下裳范畴的，但后来加入了很多女性特征元素和一些固定配件，而且要比上衣下裳華丽，因此成为漢服体系中的第3个款式——因上衣改短小改称为襦，搭配裙子成为襦裙。还有一点不同于上衣下裳的，襦裙是套装，比如颜色和花纹不是随意搭配的，而是配套的。
                      </p>
                      <p>
                        袍衫：而在东漢，已开始有了上下通裁的长衣，但虽叫长衣，在具体长度尺度方面还是没有定制。而两侧缺胯（开叉）的袍衫，在那时已出现，袍和衫的不同地方在于袍有夹层，也就是双层，衫没有，比较单薄，因此，又出现了漢服体系的第4个款式——（因长衣没发展完善，故不算）袍衫类。
                      </p>
                      <p>
                        发型：秦时期看兵马俑当然还是有编辫束发的，但漢时已可以明确不编辫束发成为主流，这种不编辫束发的简单束发模式，也是后世一直沿用到明的漢族男子基本发式。而再后来的束发基本都是头发全盘到顶部，并非上面束发余发披肩。
                      </p>
                      <p>
                        冠帽巾：由于舆服制度的创立，冠已不在是随便谁都可以戴的了，戴冠已成为区分等级的标志。新出现的冠有文官的进贤冠，武官的武弁等，东漢时期的平巾，加梁成为文官的梁冠，加漆纱成为武官的漆纱冠，这两一直延续到隋唐宋明。而冕冠已上升到只有帝王配戴的地位。民间男子只束发后用簪子插发加以固定即可，或者在发髻处加包巾裹发。因这个制度，漢时期也是个大量产生帽巾的时期。
                      </p>
                      <p>
                        圆领：在以前领子制度只有交领的情况下，秦漢时受西北民族的影响（一说），圆领（书面名盘领）元素开始介入到漢民族服饰当中。
                      </p>
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="前206年-220年"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>汉朝汉服（公元前206年左右）</h4>
                      <p>
                        汉朝是中国最重要和杰出的王朝之一。在这一时期随着社会的进步，本土民族文化蓬勃发展，达到了极高的艺术和审美成就。在经济，科技，文化上全面领先于世界的汉帝国为华夏儿女留下了永远的自豪。今天，占据绝大多数的中国主体民族-汉族，就是以汉朝的名字命名的。
                      </p>
                      <p>
                        从这一时期开始，平民开始穿着精织服饰。汉代曲裾深衣不仅男子可穿，同时也是女服中最为常见的一种服式。这种服装通身紧窄，长可曳地，下摆一般呈喇叭状，行不露足，以表示出女性的文静与优雅。衣袖有宽窄两式，袖口大多镶边。衣领部分很有特色，通常用交领，领口很低，以便露出里衣。如穿几件衣服，每层领子必露于外，最多的达三层以上，时称“三重衣”。另外，汉代窄袖紧身的绕襟深衣。衣服几经转折，绕至臀部，然后用绸带系束，衣上还绘有精美华丽的纹样。
                      </p>
                      <p>
                        汉代的直裾男女均可穿着。这种服饰早在西汉时就已出现，但不能作为正式的礼服。原因是古代裤字皆无裤裆，仅有两条裤腿套到膝部，用带子系于腰间。这种无裆的裤子穿在里面，如果不用外衣掩住，裤子就会外露，这在当时被认为是不恭不敬的事情。所以外要穿着曲裾深衣。以后，随着服饰的日益完备，裤子的形式也得到改进，出现有裆的裤子。由于内衣的改进，曲裾绕襟深衣已属多余，所以至东汉以后，直裾逐渐普及，并替代了深衣。
                      </p>
                      <p>
                        汉代妇女的襦裙
                        上襦下裙的女服样式，早在战国时代已经出现。到了汉代，由于深衣的普遍流行，穿这种服式的妇女逐渐减少。据此，有人认为汉代根本不存在这种服饰，只是到了魏晋南北朝时才重新兴起。其实，汉代妇女并没有摒弃这种服饰，在汉乐府诗中就有不少描写。这个时期的襦裙样式，一般上襦极短，只到腰间，而裙子很长，下垂至地。襦裙是中国妇女服装中最主要的形式之一。自战国直至明朝，前后二千多年，尽管长短宽窄时有变化，但基本形制始终保持着最初的样式。
                      </p>
                      <p>
                        湖南 马王堆汉墓
                        出土的汉代大量丝绣织品，生动呈现出其装饰风格的特点，并反映出来汉代纺织业的发展水平。汉代的染织工艺在继承战国传统的基础上有着飞跃的发展，染织的品种增多，不仅能织出精美多样的花纹，而且染织技术也有较高的水平，染织工艺的进步是汉代服装质量得以提高的基础。随着著名的
                        丝绸之路
                        的建立，中华服饰之美，从此开始得以传向四面八方。
                      </p>
                      <!-- <div class="block">
                          <span class="demonstration">商朝汉服样式</span>
                          <el-image :src="src1">
                            <div
                              slot="placeholder"
                              class="image-slot"
                            >
                              加载中<span class="dot">...</span>
                            </div>
                          </el-image>
                        </div> -->
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="220年-589年"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>魏晋南北朝汉服（220年左右）</h4>
                      <p>
                        魏晋时期，风流名士们崇尚自然、超然物外，率真任诞而风流自赏。姿容飘逸的魏晋风度也反映到了汉服上，这一时期的男子一般都穿大袖衫——大袖翩翩的衫子，上自王公名士，下及黎庶百姓，都以宽衫大袖，褒衣博带为尚。直到南朝时期，这种衫子仍为各阶层男子所爱好。衫和袍在样式上有明显的区别，照汉代习俗，凡称为袍的，袖端应当收敛，并装有祛口。而衫子却不需施祛，袖口宽敞。魏晋服装日趋宽博，而衫由于不受衣祛等部约束，故成为一时风俗。
                      </p>
                      <img
                        src="@/assets/images/knows/history/魏晋南北朝.jpg"
                        class="image"
                      />
                      <p>
                        魏晋南北朝时期的妇女的衫裙魏晋时期妇女服装承袭秦汉的遗俗，并吸收少数民族服饰特色，在传统基础上有所改进，一般上身穿衫、袄、襦，下身穿裙子，腰用帛带系扎，款式多为上俭下丰，以宽博为主，其特点为：对襟，束腰，衣袖宽大，并在袖口、衣襟、下摆缀有不同色的缘饰，下着条纹间色裙，腰间用一块帛带系扎。衣身部分紧身合体，袖口肥大，裙为多折裥裙，裙长曳地，下摆宽松，从而达到俊俏潇洒的效果。加上丰盛的首饰，反映出奢华糜丽之风。当时妇女的下裳，除间色裙外，还有其它裙式。
                      </p>
                      <img
                        src="@/assets/images/knows/history/魏晋南北朝1.jpg"
                        class="image"
                      />
                      <p>
                        魏晋南北朝时期的杂裾服传统的深衣制已不被男子采用，但在妇女中间却仍有人穿着。这种服装与汉代相比，已有较大的差异。在衣服的下摆部位，加一些饰物，通常以丝织物制成。其特点是上宽下尖形如三角，并层层相叠。另外，由于从围裳中伸出来的飘带比较长，走起路来，如燕飞舞。到南北朝时，这种服饰又有了变化，去掉了曳地的飘带，而将尖角的“燕尾”加长，使两者合为一体。
                      </p>
                      <img
                        src="@/assets/images/knows/history/魏晋南北朝2.jpg"
                        class="image"
                      />
                      <p>
                        南北朝时期裤褶：裤褶的基本款式为上身穿齐膝大袖衣，下身穿肥管裤。这种服装的面料，常用较粗厚的毛布来制作。穿裤和短上襦，合称襦裤，但封建贵族必须在襦裤外加穿袍裳，只有骑马者、厮徒等从事劳动的人为了行动方便，才直接把裤露在外面。封建贵族是不得穿短衣和裤外出的。到了晋代这种习惯才有所改变。南北朝的裤有大口裤和小口裤，以大口裤为时髦，穿大口裤行动不便，故用锦带将裤管缚住，有、又称缚裤。
                      </p>
                      <p>
                        服色制度：由于九品中正制，品官等级被正式划分鲜明，设置了九品官，每级的礼服常服的颜色都要不一样。从此以后，服色制度成为礼服等级的一个标准，而以前，则多用绶佩区分，不用服色。
                        上衣下裳：由于魏晋又是一个思想大动荡的时期，常服中上衣下裳装束已不受人们所宠爱，由于受一部分思潮影响，衣裳日趋宽大飘逸，袖也多变为敞口的魏晋风骨。
                      </p>
                      <P>
                        衣裳连制（深衣）：深衣也退居到士大夫阶层和民间小礼服阶层，并且衣比之前朝更加宽大。民间似乎更喜欢新兴的袍衫和褶绔。
                      </P>
                      <P>
                        袍衫：很受欢迎，已开始有园领袍衫。
                      </P>
                      <P>
                        上衣下裤（褶绔）：应该说，前朝已有上短衣下裤的装束了，但那时的搭配较之随意，，而且下裤种类繁多，不宜构成固定款式。但当时发展出来的褶绔，成为主流，而且搭配固定，因此是为漢服体系中的第5个款式——上衣下裤（褶绔）类。具体是，上穿短衣，下穿裤子，比较宽大，呈上窄下宽喇叭状，带有褶皱。有时在膝上用带子捆绑或扎系，成为缚绔。
                      </P>
                      <P>
                        上襦下裙：当时秦漢到魏晋时期的初期襦裙，虽衣裳已分开，但外观上还保留了一些深衣的特征，比如袖仍是祛袂，下裳宽大，裙腰高长等特征。
                      </P>
                      <P>
                        冠帽巾：帽巾类得到空前的发展，基本后世有的在那时都有了。因冠已成为等级的标志，民间男子便发明了很多种巾帽。比如出现了幅巾，纶巾等。当时的冠出现了漆纱笼冠，为很重要的礼臣所戴。
                      </P>
                      <P>
                        直领：当时在已有交领，圆领的基础上，通过交领发明了直领。
                      </P>

                      <!-- 
                        <div class="block">
                          <span class="demonstration">商朝汉服样式</span>
                          <el-image :src="src1">
                            <div
                              slot="placeholder"
                              class="image-slot"
                            >
                              加载中<span class="dot">...</span>
                            </div>
                          </el-image>
                        </div> -->
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="589年-960年"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>隋唐汉服（589年左右）</h4>
                      <p>
                        公元581年，隋朝的建立，结束了自东汉以来相继四百年的分裂局面。这是继秦汉之后再度建立的封建统一国家，一个以汉族为中心的新的民族共同体。南北两地服装彼此仿效，业以合壁。唐朝时中国封建社会的鼎盛时期，揭开了中国古代最为灿烂夺目的篇章。唐朝时国家稳定，经济繁荣、文化事业全面发展，封建文化已经达到高峰。近三百年的唐代服饰经过长期的承袭、演变、发展成为中国服装发展上一个极为重要的时期。一方面唐代服装上承历代冠服制度，下启后世衣冠之径道；另一方面唐朝服装发展兼容并蓄，广采博收，大放异彩。唐以后的五代十国是唐宋封建军阀割据的继续，在服饰上大体沿袭唐朝之制。隋唐服装无论官服或民服，男装和女装，都表现其开放的思想、开拓的精神，充分反映了鲜明的时代性和强烈的民族性。
                      </p>
                      <img
                        src="@/assets/images/knows/history/隋唐汉服.jpg"
                        class="image"
                      />
                      <P>
                        襦裙是唐代妇女的主要服式。在隋代及初唐时期，妇女的短襦都用小袖，下着紧身长裙，裙腰高系，一般都在腰部以上，有的甚至系在腋下，并以丝带系扎，给人一种俏丽修长的感觉。披帛，又称“画帛”，通常一轻薄的纱罗制成，上面印画图纹。长度一般为二米以上，用时将它披搭在肩上，并盘绕于两臂之间。唐代妇女，以体态丰腴为美。由于身材丰硕，中唐女服也渐趋宽大，裙子的宽度比隋末唐初时要肥大的多。衣衫虽为小袖，但与初唐、盛唐女服相比，也明显趋于宽松。
                      </P>
                      <img
                        src="@/assets/images/knows/history/隋唐汉服1.jpg"
                        class="image"
                      />
                      <P>
                        唐代大袖衫盛唐以后，胡服的影响逐渐减弱，女服的样式日趋宽大。到了中晚唐时期，这种特点更加明显，一般妇女服装，袖宽往往四尺以上。中晚唐之际的贵族礼服，一般多在重要场合穿着，如朝参、礼见及出嫁等。穿着这种礼服，发上还簪有金翠花钿，所以又称“钿钗礼衣”。大袖衫裙样式为大袖、对襟，佩以长裙、披帛。以纱罗作女服的衣料，是唐代服饰中的一个特点，这和当时的思想开放有密切关系。尤其是不着内衣，仅以轻纱蔽体的装束，更是创举，所谓“绮罗纤缕见肌肤”，就是对这种服装的概括。
                      </P>
                      <img
                        src="@/assets/images/knows/history/隋唐汉服2.jpg"
                        class="image"
                      />
                      <P>
                        隋唐时代也产生了汉服的一种
                        重要变体圆领衫。圆领式样在中国服饰历史上很早便有出现，但一直到隋唐才开始盛行，成为官式常服。这种服装延续了唐，五代，宋，明，并对日本，高丽等国产生了很大的影响。裹幞头、穿圆领袍衫是唐代男子的普遍服饰，以幞头袍衫为尚。幞头又称袱头，是在汉魏幅巾基础上形成的一种首服。唐代以后，人们又在幞头里面增加了一个固定的饰物，名为“巾子”。巾子的形状各个时期有所不同。除巾子外，幞头的两脚也有许多变化，到了晚唐五代，已由原来的软脚改变成左右各一的硬脚。
                      </P>
                      <img
                        src="@/assets/images/knows/history/隋唐汉服3.jpg"
                        class="image"
                      />
                      <P>
                        需要指出的是，这种圆领汉服变体的盛行并不代表传统右衽交领汉服的消失。实际上，即便是在其最盛行的唐朝，也多局限于以长安为中心的地区，以及官员，皇室成员之中，而在如吴越地区以及普通百姓之间，则以大襟右衽交领这种汉服为主，宋明类似。唐代官吏，除穿圆领窄袖袍衫之外，在一些重要场合，如祭祀典礼时仍穿礼服。礼服的样式，多承袭隋朝旧制，头戴介帻或笼冠，身穿对襟大袖衫，下着围裳，玉佩组绶等。圆领汉服和交领汉服一样，是汉民族服饰的重要组成部分。
                      </P>
                      <img
                        src="@/assets/images/knows/history/隋唐汉服4.jpg"
                        class="image"
                      />
                      <P>
                        上衣下裳：仍有。
                      </P>
                      <P>
                        衣裳连制（深衣）：仍就是士大夫居家和民间小礼服。
                      </P>
                      <P>
                        袍衫：袍衫可谓空前盛行，成为民间的主流服饰，当时品官常服开始采用圆领袍，一直延续到明，也就是我们后来说的官袍或公服。
                      </P>
                      <p>
                        上襦下裙：那时女子的襦裙，上襦变短只到胸部，裙子变宽大，系到胸部，然后系以长裙带几乎垂地，类似于现在的朝鲜女装。袖子基本上都变成了小袖，后期小袖垂下一部分，遮住手，显得纤细，成为垂袖。一开始的时候襦裙上披一块又方又厚类似于披风的东西，成为帔子。后来变长，变窄，只成一布条，固定在肩膀上，披法花样繁多，成为披帛。后来，帔子和披帛成为襦裙中不可分割的一元素，一直延续到明。
                      </p>
                      <p>
                        中唐到五代时期的襦裙，风格又回归到了魏晋时期，襦仍是到腰胯，裙子变窄，裙腰高耸，只不过袖子还是小袖。
                      </p>
                      <p>
                        阑衫：阑衫本属于袍衫类，因隋唐时期男子官服，本穿的是杉，但长度只到膝，膝处设一界限，称为横阑，下面则是用裳续上。因此，他虽然大范畴属于泡衫类，但构造上更像泡衫和深衣的综合体，因此，又成了漢服体系中的第6个款式——阑衫类。因早期阑衫是作为官服出现的，领子都用圆领，而后来的阑衫，大致也遵循了这一点，只不过领边变宽，并且接衽了。明时为有官职人员的公服。
                        直裰：前面提到前朝上下通裁的长衣，像袍衫出自长衣。而原本的长衣却没有形成定制。但是到了隋唐时期，长衣规定长度到脚踝，并且要有宽衣缘，而且都是交领，两侧不能缺胯（开叉），因此又形成了漢服体系中的第7个款式——直裰（直身）类。当时直裰的定制，主要是想复兴古礼，找个深衣类与袍衫类的最佳中间点，因此直裰，也是最具有规格的长衣便应运而生了。
                      </p>
                      <p>
                        袄子——大袖衣——旋袄——褙子：当时流行一种襦，但不同的是直领相系，并且两侧开叉到腋下，这样就有点半披半穿的感觉，当时称为袄子。后来女子礼服用的大袖衣，也是参照这个，开叉到腋下，直领相系，之所以叫大袖衣，只不过袖子是大袖，衣稍长点而已。后来到宋朝时，变窄变长，袖子又变成小袖，这回还是直领，但就是不相系了，成为旋袄。明时又变宽，袖子变大，变成半直领相系（有带子）下面自然开叉。因这一系列都是一脉相成下来而且没有款式上的变化，因此他们又可以归为一类，成为漢服体系中的第8个款式——统称为褙子类。褙子最主要的特点就是直领相系，两侧开叉到腋下，初期多用于礼服，后来成为定制，比如女子多穿襦裙，妇人和民间礼仪活动时多穿褙子。这也就是朝鲜时期的宫廷唐衣（韩剧中王妃尚宫所穿的交领褙子不过。到明又出现无袖和半袖的褙子，当时已经男女通用了。
                      </p>
                      <p>
                        半臂：当时又流行一种襦，是半袖和无袖的，多是直领相系，有小带子系到胸部。如果另算的话，也可以算做漢服体系中的第9个款式——半臂类。由于是半袖和无袖的，一般都当套在襦裙外的外套穿。不过我看他更应该归纳到襦里面。
                      </p>
                      <p>
                        冠帽巾：除了冠巾不变之外，此时是帽类空前发展的一个时期。如幞头，最初的无翅——到软翅——到硬翅——到直翅——再到展翅，直翅后来成为明朝品官的乌纱帽，展翅后来成为宋朝品官的乌纱帽。如斗笠，在那时也产生。如女子的帷帽，面幕。
                      </p>

                      <!-- <div class="block">
                          <span class="demonstration">商朝汉服样式</span>
                          <el-image :src="src1">
                            <div
                              slot="placeholder"
                              class="image-slot"
                            >
                              加载中<span class="dot">...</span>
                            </div>
                          </el-image>
                        </div> -->
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="960-1279年"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>宋代汉服（960年左右）</h4>
                      <p>
                        宋朝是一个在经济，科技和文化上高度发达的王朝。农业，制船，纺织和造纸业达到了新的高度，火药，指南针和印刷技术被发明。宋代服饰总体来说可分官服与民服两大类。官服又分朝服和公服。朝服用于朝会及祭祀等重要场合，皆朱衣朱裳，佩带和衬以不同颜色和质地的衣饰，还有相应的冠冕。公服是官员的常服，式样是圆领大袖，腰间束以革带，头上戴幞头，脚上穿革履或丝麻织造的鞋子。依照规定，凡有资格穿紫、绯色公服的高级官员，都必须佩带用金、银装饰为鱼形的“鱼袋”。庶民百姓只许穿白色衣服，后来又允许流外官、举人、庶人可穿黑色衣服。但实际生活中，民间服色五彩斑斓，根本不受约束。
                      </p>
                      <img
                        src="@/assets/images/knows/history/宋代汉服.jpg"
                        class="image"
                      />
                      <p>
                        宋代妇女服饰——宋代一般妇女所穿服饰有袄、襦、衫、背子、半臂、裙子、裤等服装样式。宋代妇女以裙装穿着为主，但也有长裤。宋代妇女的穿着与汉代妇女相似，都是瘦长、窄袖、交领，下穿各式的长裙，颜色淡雅。襦和袄是基本相似的衣着，形式比较短小，下身配裙子。颜色常以红、紫为主，黄次之。宋代的襦裙样式和唐代的襦裙大体相同。身上的装饰并不复杂，除披帛以外，只在腰间正中部位佩的飘带上增加一个玉制圆环饰物，它的作用，主要是为了压住裙幅，使其在走路或活动时不至会随风飘舞而影响美观，史书所称的“玉环绶”，就是这种装饰。
                      </p>
                      <img
                        src="@/assets/images/knows/history/宋代汉服1.jpg"
                        class="image"
                      />
                      <p>
                        宋朝流行一种叫褙子的外衣，宋代的褙子为长袖、长衣身，腋下开胯，即衣服前后襟不缝合，而在腋下和背后缀有带子的样式。这腋下的双带本来可以把前后两片衣襟系住，可是宋代的褙子并不用它系结，而是垂挂着作装饰用，意义是模仿古代中单（内衣）交带的形式，表示“好古存旧”。穿褙子时，却在腰间用勒帛系住。宋代褙子的领型有直领对襟式、斜领交襟式、盘领交襟式三种，以直领式为多。斜领和盘领二式只是在男子穿在公服里面时所穿，妇女都穿直领对襟式。有身份的主妇则穿大袖衣。婢妾穿腋下开胯的衣服，行走也较方便。宋代女子所穿褙子，初期短小，后来加长，发展为袖大于衫、长与裙齐的标准格式。
                      </p>
                      <p>
                        宋朝漢民族服饰基本延续了唐朝的，唐朝和先朝有什么，就有什么，没有变化。
                      </p>
                      <p>
                        衣裳连制（深衣）：仍就是士大夫居家和民间小礼服。不过和前朝比，深衣在民间又开始活跃起来，深衣越来越倾向于礼制化的地位，朱熹家礼中制定了深衣的一种规格，成为朱子深衣，而宋朝的深衣，袖子多比较宽大。
                      </p>
                      <p>
                        上襦下裙：在五代回复正常以后，只裙子系到高出腰部，而且不要固定腰形的裙腰，直接显出腿的纤长来。而明基本延续宋风。
                      </p>
                      <p>
                        冠帽巾：冠帽巾在前朝不变的基础上，有新出几个。比如很多名人发明了巾。如朱熹的朱子幅巾，苏东破的东破巾，周子的周子巾等。幞头方面，幞头都变成方形，新出的有曲翅幞头，花装幞头等。
                      </p>
                      <p>
                        方心曲领：在礼服上套上方心曲领。
                      </p>

                      <!-- <div class="block">
                          <span class="demonstration">商朝汉服样式</span>
                          <el-image :src="src1">
                            <div
                              slot="placeholder"
                              class="image-slot"
                            >
                              加载中<span class="dot">...</span>
                            </div>
                          </el-image>
                        </div> -->
                    </el-card>
                  </el-timeline-item>

                  <el-timeline-item
                    timestamp="1368年-1644年"
                    placement="top"
                  >
                    <el-card style="background-color:#ffffff70">
                      <h4>明代汉服（1368年左右）</h4>
                      <p>
                        历经蒙古帝国元朝的野蛮统治，中国在经济，科技，文化上全面倒退。蒙元末，中国经济与社会陷入彻底崩溃和混乱。为重塑礼仪与民族自尊心，明朝复国以后，十分重视整顿和恢复服饰制度，很快丢弃了蒙元少数民族服度，上采周汉，下取唐宋，全面恢复了汉族服饰的特点。明代服饰仪态端庄，气度宏美，是华夏近古服饰艺术的典范，当今中国戏曲服装的款式纹彩，多采自明代服饰。明代的章服衣冠更趋豪奢，织绣技艺迈向顶峰，文化内涵更加丰富。
                      </p>
                      <img
                        src="@/assets/images/knows/history/明代汉服.jpg"
                        class="image"
                      />
                      <p>
                        明代襦裙明代上襦下裙的服装形式，与唐宋时期的襦裙没有什么差别，只是在年轻妇女中间，常加一条短小的腰裙，以便活动，有些侍女丫环也喜欢这种装束。上襦为交领、长袖短衣。裙子的颜色，初尚浅淡，虽有纹饰，但并不明显。至崇祯初年，裙子多为素白，即使刺绣纹样，也仅在裙幅下边一、二寸部位缀以一条花边，作为压脚。裙幅初为六幅，即所谓“裙拖六幅湘江水”；后用八幅，腰间有很多细褶，行动辄如水纹。到了明末，裙子的装饰日益讲究，裙幅也增至十幅，腰间的褶裥越来越密，每褶都有一种颜色，微风吹来，色如月华，故称“月华裙”。
                        腰带上往往挂上一根以丝带编成的“宫绦”，一般在中间打几个环结，然后下垂至地，有的还在中间串上一块玉佩，借以压裙幅，使其不至散开影响美观，作用与宋代的玉环绶相似。
                      </p>
                      <img
                        src="@/assets/images/knows/history/明代汉服1.jpg"
                        class="image"
                      />
                      <p>
                        明代官吏服饰公服明代穿公服的官吏。其制为盘领右衽，袖宽三尺。袍服所用的纹样及颜色，因级别而异：一至四品，用绯色；五至七品，用青色；八至九品，用绿色。纹样也不一样，一品用大朵花，径五寸；二品用小朵花，径三寸；三品用散花，无枝叶，径二寸；四[品五品用小朵花，径一寸五分；六[品七品用小朵花，径一寸；八品以下，无花纹。以上服饰，与展脚幞头搭配，多用于重大朝会。
                      </p>

                      <!-- <div class="block">
                          <span class="demonstration">商朝汉服样式</span>
                          <el-image :src="src1">
                            <div
                              slot="placeholder"
                              class="image-slot"
                            >
                              加载中<span class="dot">...</span>
                            </div>
                          </el-image>
                        </div> -->
                    </el-card>
                  </el-timeline-item>
                </el-timeline>
              </el-container>
            </el-tab-pane>

            <el-tab-pane
              label="汉服形制"
              name="second"
            >
              <el-tabs
                :tab-position="tabPosition"
                style="padding-top: 15px;min-height: 800px;line-height: 25px;"
              >
                <!-- <el-tab-pane label="华夏衣裳"></el-tab-pane> -->
                <el-tab-pane label="衣裳制">
                  <div style="background-color:#ffffff70;">
                    <h4>
                      上衣下裳分裁制
                    </h4>
                    <p>
                      上衣下裳制即把上衣和下裳分开来裁，上身穿衣，下体穿裳，下裳中的“裳”也即裙子，上衣下裳制是汉服体系中最古老的形制。汉语所谓“衣裳”就是来源于此。
                    </p>
                    <p>
                      说汉服有四千年历史，那么上衣下裳制就有这么长的历史。未找到目录项。
                    </p>
                    <p>
                      《易经》中说此制为黄帝尧舜时所创，取之于天地的形与色。天在上，地在下，故衣在上，裳在下，“衣正色，裳间色”（上衣颜色端正而且纯一，下裳则色彩相交错），好比是“天玄地黄”（天是清轻之气上升而成，所以用纯色，地是重浊之气下降而成，所以用间色），故最高级别的“衣裳”多为黑色、黑红色、玄纁色。
                    </p>
                    <p>
                      “上衣下裳”是我国古代最基本的服饰形制，也是历代男子礼服的最高形制，一直到明朝都是如此。比如冕服、玄端：
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/上衣下裳.jpg"
                      class="image"
                    />
                    <hr />
                    <img
                      src="@/assets/images/knows/xingzhi/冕服.jpg"
                      class="image"
                    />
                    <p>
                      上衣下裳制产生流行的主要时代是先秦，是汉服的源头、基础形制，后文介绍的深衣制、袍衫制都是在上衣下裳的基础上演变出来的。上衣下裳也是适应性最广的穿法，不限男女，既可以是华贵严肃的礼服，也可以是方便轻松的常服，汉代以后流行的上襦下裙制、上衣下裤制本质上也都属于“上衣下裳”。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/苏轼着上衣下裳.jpg"
                      class="image"
                    />
                  </div>
                </el-tab-pane>
                <el-tab-pane label="深衣制">
                  <div style="background-color:#ffffff70;">
                    <h4>
                      上下连缝制
                    </h4>
                    <p>
                      深衣制形成于周朝，周朝分为西周和东周，东周也就是春秋战国，当时的社会正发生着深刻转变，深衣制就是在这一历史背景下诞生的。
                    </p>
                    <p>
                      深衣制是上衣和下裳分开裁剪，在腰部相连，形成整体，也即上下连裳，在裁剪上就是分别裁好上衣和下裙，然后再缝缀在一起，最后衣服还是一体的样式。深衣男女均可穿，即被用作礼服，又可日常穿着，可做君主百官及士人燕居（非正式场合）时的休闲类服饰。深衣普及率很高，流传的时间有三千多年：从先秦到明代末年。
                    </p>
                    <p>
                      深衣有两大类：直裾和曲裾。主要作为正规场合礼服，男女皆穿，它大气儒雅、中正平和、风韵满满。
                      直裾：左大襟从前胸绕到右后方之后垂直而下，故称直裾，简洁干练、中正肃穆，它是历代男子礼服的通用服饰，影响极其深远。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/曲裾深衣.jpg"
                      class="image"
                    />
                    <p>
                      曲裾：“裾”就是裙子的意思，曲裾就是弯曲盘绕的裙子，和直裾相比，它的襟是围着下体层层盘绕，最后系于腰部，其曲线优美流畅，令人赏心悦目。一说到曲裾，熟悉汉服的人第一反映就是想起那个强悍无比的大汉王朝，因为曲裾在那个时候可以说是泛滥成灾了，上至皇帝文武百官，下至于平民布衣皆穿曲裾。
                    </p>
                    <p>
                      深衣制是汉服体系中最值得探讨、最值得研究的形制，它的裁剪形制有着十分明确的规范和要求，它可以说是汉服体系的核心精髓所在。如果说汉服是一部交响乐，那么，深衣制就确定了这部交响乐的基调，它是这部交响乐的灵魂。我们伟大的先祖们在创造这一服制时，应是出于当时社会生活的需要，做出一套规范和形制要求，但这一制度却成为后世服饰的核心，一穿就是3000多年，其规范没有丝毫变动，实在是奇迹！
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/深衣.jpg"
                      class="image"
                    />
                  </div>
                </el-tab-pane>
                <el-tab-pane label="袍服制">
                  <div style="background-color:#ffffff70;">
                    <h4>
                      上下通裁制
                    </h4>
                    <p>
                      即用一块布裁出上衣和下衣，中间无接缝，自然一体，明显区别于上衣下裳制和深衣制。这一形制始创于隋唐，这在当时来说是一个创举，因为自古汉服都是分上下两截的。通裁制的种类很多，圆领袍、襕衫、直裰、直身、道袍、褙子、长衫、僧衣等。这些最流行的时期在宋代和明代，皇帝贵族平时也喜欢这么穿，更是文人骚客们的休闲装。
                    </p>
                    <p>1.圆领袍</p>
                    <p>
                      汉代随着服饰逐渐统一，圆领袍主要作为内衣穿着。溯其由传人以至兴盛，由军用以至民服，历史悠长，变化复杂，圆领亦称团领，实为无领型领式。衣领形似圆形，内覆硬衬，领口钉有纽扣。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/李白圆领袍.jpg"
                      class="image"
                    />
                    <p>2.道袍</p>
                    <p>
                      一种源自中国古代汉服“褶”(相传周武王亲制)，在明代演变为道袍，是明代男子居家时的外衣，也可作衬袍或平民男子婚服。后在清初“剃发易服”的政策下消亡。
                      其特点是直领，大襟，两侧开衩，有暗摆，为汉民族最具特色的传统服饰之一。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/道袍.jpg"
                      class="image"
                    />
                    <p>3.褙子</p>
                    <p>
                      褙子，又名背子、绰子、绣䘿，是汉服传统服饰的一种，始于隋朝。褙子直领对襟，两侧从腋下起不缝合，多罩在其他衣服外穿着，流行于宋、明两朝。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/褙子.png"
                      class="image"
                    />
                    <p>4.直裰</p>
                    <p>
                      直裰起源于唐朝，是从宋朝开始就有的一种汉服服饰。据宋
                      赵彦卫《云麓漫钞》谓：“古之中衣，即今僧寺行者直裰。”两宋时期的直裰多为僧侣穿着（少数文人也有穿着）。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/直裰.jpg"
                      class="image"
                    />
                  </div>
                </el-tab-pane>
                <el-tab-pane label="襦裙制">
                  <div style="background-color:#ffffff70">
                    <h4>
                      上衣下裳的演变
                    </h4>
                    <p>
                      襦即短上衣。襦裙不是指一种裙子，而是上襦加下裙，是一套服饰的统称。
                    </p>
                    <p>
                      襦裙属于汉服的一种，上身穿的短衣和下身束的裙子合称襦裙，是典型的“上衣下裳”衣制。上衣叫做“襦”，长度较短，一般长不过膝，下身则叫“裙”。
                    </p>
                    <p>
                      襦裙的本质还是上衣下裳制，古老的上衣下裳发展到春秋战国之后往往称为襦裙，汉朝以后又被特指为女子襦裙：短衣长裙，腰间以绳带系扎，衣在内，裙在外。各朝各代在襦裙的基本形制下衍生出高腰襦裙、半臂襦裙、对襟襦裙、齐胸襦裙等款式，这些款式没有很多的礼仪规定，一般是用于常服的，所以普及面很广。
                    </p>
                    <p>
                      襦裙又分为齐腰襦裙、高腰襦裙、齐胸襦裙等。搭配半臂穿着又称半臂襦裙，可搭配披帛。披帛，又称“画帛”，通常一轻薄的纱罗制成，上面印画图纹。长度一般为二米以上，用时将它披搭在肩上，并盘绕于两臂之间。
                    </p>
                    <p>
                      除此之外，还有上衣下裤形制等等。上衣下裤是历代男子常服之一，用于劳作及日常穿着等，十分方便，是劳动者的工作服。
                    </p>
                    <p>1.交领襦裙</p>
                    <p>
                      特点是上襦为交领，交领襦裙在宋代颇为常见。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/交领襦裙.png"
                      class="image"
                    />
                    <p>2.对襟襦裙</p>
                    <p>
                      其上襦为直领，衣襟呈对称状，故称对襟襦裙。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/对襟襦裙.png"
                      class="image"
                    />
                    <p>3.坦领襦裙</p>
                    <p>
                      坦领，又称U领，汉服半臂中的一种，是从魏、晋以来上襦发展出的一种短外衣。由于胡文化在当时的唐代各阶层间的广泛流行，使得唐代女性穿小袖衣成为一种风尚。流行于隋代宫廷内，先为宫中内官、女史所服，唐代传至民间，历久不衰。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/坦领襦裙.png"
                      class="image"
                    />
                    <p>4.齐胸襦裙</p>
                    <p>
                      齐胸襦裙是汉民族传统服饰的的一种，汉晋以来裙子的裙腰束于腰上，而隋唐五代时期裙子的裙腰束得更高，很多都在胸上，一些服装史上多称之为高腰襦裙，根据现在人们对它的考证，一般改称之为齐胸襦裙，齐胸襦裙至今没有服装文物出土。齐胸襦裙属于早期复原错误的称呼，正确的叫法应为齐胸衫裙。
                    </p>
                    <img
                      src="@/assets/images/knows/xingzhi/齐胸襦裙.png"
                      class="image"
                    />
                  </div>
                </el-tab-pane>
                <el-tab-pane label="华夏衣裳">
                  <div style="background-color:#ffffff70;;height:800px">
                    <p>
                      总结： 最开始的上衣下裳制以及深衣制不限男女，
                      但后来男子着裙裳逐渐被长衫袍服所代替，“上衣下裳”和深衣由日常生活逐渐退隐到礼仪祭祀中去，成为汉服礼服。春秋战国秦汉时期女子着衣与男子款式大致相同，到了汉代以后，女子汉服又从从连体的深衣重新回归到上古上下两截的穿法。隋唐时常说的襦裙装，上襦下裙，其实就是“上衣下裳”的一种，只不过襦稍短些、裙稍长些，它其实也是上衣掖在裙里，只不过将裙提到了胸部。到了明代，基本上相当于又一次复礼，恢复了上古那种正统的“衣裳”制式。
                    </p>
                    <p>
                      汉服四大形制，“上衣下裳”的古制是基础，深衣制是其发展，袍服制其实就是把上衣加长，而襦裙制则是把上衣缩短，分别向不同的方向发展出“上衣下裳”的各种变形。
                    </p>
                  </div>
                </el-tab-pane>
              </el-tabs>
            </el-tab-pane>

            <el-tab-pane
              label="汉服周边"
              name="third"
            >
              <el-tabs
                :tab-position="tabPosition"
                style="margin-top: 15px;min-height: 800px;line-height: 35px;"
              >
                <el-tab-pane label="华夏衣裳">
                  <div style="background-color:#ffffff70;">
                    <p>
                      配饰指汉服中易更换、易变动位置的饰物。除腰带属于汉服的必要组成部分外，其他配饰视场合和情况穿戴。配饰种类繁多，根据用途不同可分为腰带、披帛、首饰等……
                    </p>
                    <p>
                      首服指头上的冠戴服饰，是汉服文化含义的重要体现，每种样式几乎都带有一定相应的文化故事，很多巾帽由名人发明，并作为某种文化思想的代表并流传下来。例如苏东坡发明的东坡巾，孟浩然发明的浩然巾等，根据形制和用途不同可分为冠冕类和巾帽类
                    </p>
                  </div>
                </el-tab-pane>
                <el-tab-pane label="饰品">
                  <el-tabs
                    @tab-click="handleClick"
                    style="font-family:'楷体';font-size:20px;"
                  >
                    <el-tab-pane
                      label="腰带"
                      name="third11"
                    > </el-tab-pane>
                    <el-tab-pane
                      label="披帛"
                      name="third12"
                    >深衣制</el-tab-pane>
                    <el-tab-pane
                      label="首饰"
                      name="third13"
                    >袍服制</el-tab-pane>
                    <el-tab-pane
                      label="其他"
                      name="third14"
                    >袍服制</el-tab-pane>
                  </el-tabs>
                </el-tab-pane>
                <el-tab-pane label="首服">
                  <el-tabs
                    @tab-click="handleClick"
                    style="font-family:'楷体';font-size:20px;"
                  >
                    <el-tab-pane
                      label="冠冕类"
                      name="third21"
                    > </el-tab-pane>
                    <el-tab-pane
                      label="巾帽类"
                      name="third22"
                    >深衣制</el-tab-pane>
                    <el-tab-pane
                      label="足衣"
                      name="third23"
                    >袍服制</el-tab-pane>
                    <el-tab-pane
                      label="鞋"
                      name="third24"
                    >袍服制</el-tab-pane>
                    <el-tab-pane
                      label="靴"
                      name="third25"
                    >袍服制</el-tab-pane>
                    <el-tab-pane
                      label="袜"
                      name="third26"
                    >袍服制</el-tab-pane>
                    <el-tab-pane
                      label="其他"
                      name="third27"
                    >袍服制</el-tab-pane>
                  </el-tabs>
                </el-tab-pane>
                <el-tab-pane label="道具">
                  <el-tabs
                    @tab-click="handleClick"
                    style="font-family:'楷体';font-size:20px;"
                  >
                    <el-tab-pane
                      label="油纸伞"
                      name="third31"
                    > </el-tab-pane>
                    <el-tab-pane
                      label="扇子"
                      name="third32"
                    >深衣制</el-tab-pane>
                    <el-tab-pane
                      label="斗笠"
                      name="third33"
                    >袍服制</el-tab-pane>
                    <el-tab-pane
                      label="弓箭"
                      name="third34"
                    >袍服制</el-tab-pane>
                  </el-tabs>
                </el-tab-pane>
              </el-tabs>
            </el-tab-pane>

            <el-tab-pane
              label="相关文化"
              name="fourth"
            >
              <el-tabs
                :tab-position="tabPosition"
                style="padding-top: 15px;height: 700px;line-height: 35px;"
              >
                <el-tab-pane label="和服"></el-tab-pane>
                <el-tab-pane label="韩服">深衣制</el-tab-pane>
                <el-tab-pane label="少数民族服装">
                  <el-tabs
                    @tab-click="handleClick"
                    style="font-family:'楷体';font-size:20px;"
                  >
                    <el-tab-pane
                      label="蒙古族"
                      name="third41"
                    >
                      蒙古族</el-tab-pane>
                    <el-tab-pane
                      label="回族"
                      name="third42"
                    >回族</el-tab-pane>
                    <el-tab-pane
                      label="藏族"
                      name="third43"
                    >藏族</el-tab-pane>
                    <el-tab-pane
                      label="维吾尔族"
                      name="third44"
                    >维吾尔族</el-tab-pane>
                    <el-tab-pane
                      label="苗族"
                      name="third45"
                    >苗族</el-tab-pane>
                    <el-tab-pane
                      label="彝族"
                      name="third46"
                    >彝族</el-tab-pane>
                    <el-tab-pane
                      label="壮族"
                      name="third47"
                    >壮族</el-tab-pane>
                    <el-tab-pane
                      label="满族"
                      name="third50"
                    >满族</el-tab-pane>
                  </el-tabs>
                </el-tab-pane>
                <el-tab-pane label="少数民族服装1">
                  <el-tabs
                    @tab-click="handleClick"
                    style="font-family:'楷体';font-size:20px;"
                  >
                    <el-tab-pane
                      label="侗族"
                      name="third51"
                    >侗族</el-tab-pane>
                    <el-tab-pane
                      label="瑶族"
                      name="third52"
                    >瑶族</el-tab-pane>
                    <el-tab-pane
                      label="白族"
                      name="third53"
                    >白族</el-tab-pane>
                    <el-tab-pane
                      label="土家族"
                      name="third54"
                    >土家族</el-tab-pane>
                    <el-tab-pane
                      label="哈尼族"
                      name="third55"
                    >哈尼族</el-tab-pane>
                    <el-tab-pane
                      label="哈萨克族"
                      name="third56"
                    >哈萨克族</el-tab-pane>
                    <el-tab-pane
                      label="黎族"
                      name="third57"
                    >黎族、</el-tab-pane>
                  </el-tabs>
                </el-tab-pane>
              </el-tabs>
            </el-tab-pane>
          </el-tabs>
        </template>
      </el-main>
    </el-container>
    <scroll-top />
    <Footer />
  </div>
</template>
<script>
import Footer from "@/components/Footer.vue";
import Head from "@/components/Head.vue";
import IndexZj from "@/components/IndexZj.vue";
import ScrollTop from "@/components/ScrollTop.vue";

export default {
  name: "Knows",
  data() {
    return {
      active: "1-1",
      openeds: ["1", "2", "3"],
      activeName: "first",
      tabPosition: "left",
      src1:
        "https://fuss10.elemecdn.com/e/5d/4a731a90594a4af544c0c25941171jpeg.jpeg",
    };
  },
  methods: {
    handleClick(tab, event) {
      console.log(tab, event);
    },
    goBack() {
      this.$router.go(-1);
    },
  },
  components: {
    Head,
    Footer,
    IndexZj,
    ScrollTop,
  },
};
</script>

<style scoped>
.el-main {
  display: block;
  flex: 1;
  flex-basis: auto;
  overflow: auto;
  box-sizing: border-box;
  padding-top: 0px;
  min-height: 900px;
  background-color: rgba(255, 255, 255, 0.4);
}
/****************返回按钮层*****************/
.goback {
  float: left;
  color: #ffffff;
  font-size: 15px;
  border-radius: 30px;
  font-family: "楷体";
  background-color: #f7a7a7;
  border-color: lightpink;
}
.goback:hover {
  /* 鼠标放上去变色 */
  border-color: rgb(255, 255, 255);
  background-color: #f38787e5;
}
.words {
  font-size: 19px;
  font-family: "楷体";
  width: 10%;
  height: 40px;
  margin-left: 45%;
  background-color: #ffffff;
  border-radius: 30px;
  color: #f7a7a7;
}
.words h3 {
  padding-top: 8px;
}
/****************返回按钮层*****************/
/deep/.el-tabs__nav is-top {
  /* display: none; */
  margin-left: 0 10%;
  /* color:#f7a7a7; */
}
.el-header {
  background-color: #b3c0d1;
  color: #333;
  line-height: 30px;
}
p {
  text-indent: 2em; /*em是相对单位，2em即现在一个字大小的两倍*/
}
.el-aside {
  color: #333;
}

/deep/.el-tabs__nav {
  white-space: nowrap;
  position: relative;
  /* transition: transform 0.3s; */
  float: left;
  z-index: 2;
  padding-left: 1%;
}
/deep/.el-tabs__active-bar {
  position: absolute;
  padding-left: 10px;
  bottom: 0;
  left: 30%;
  height: 2px;
  background-color: #40a0ff00;
  z-index: 1;
  transition: transform 0.3s cubic-bezier(0.645, 0.045, 0.355, 1);
  list-style: none;
}
/deep/.el-tabs__item {
  padding: 0 15%;
  padding-left: 20px;
  padding-top: 1px;
  height: 50px;
  box-sizing: border-box;
  line-height: 35px;
  display: inline-block;
  list-style: none;
  font-size: 20px;
  font-weight: 200;
  color: #000000;
  position: relative;
}
/deep/.el-tabs__item.is-active {
  color: #f7a7a7;
}
/deep/.el-menu-item {
  margin-top: 15px;
  margin-bottom: 20px;
  font-size: 20px;
  text-align: center;
  background-color: #ffffff00;
}
/deep/.el-menu {
  border-right: solid 1px #e6e6e6;
  list-style: none;
  position: relative;
  margin: 0;
  padding-left: 0;
  background-color: #ffffff00;
}
/deep/.el-submenu__title {
  font-size: 20px;
  margin-top: 20px;
  margin-bottom: 20px;
}

/deep/.el-tabs--left .el-tabs__active-bar.is-left,
.el-tabs--left .el-tabs__active-bar.is-right,
.el-tabs--right .el-tabs__active-bar.is-left,
.el-tabs--right .el-tabs__active-bar.is-right {
  top: 0;
  bottom: auto;
  width: 0.5px;
  height: auto;
}

/deep/.el-timeline {
  margin: 0;
  font-size: 20px;
  color: #f7a7a7;
  list-style: none;
}
</style>